A base class containing import options used during import of several formats.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public class BaseImportOptions : IDisposable
  Visual Basic
Public Class BaseImportOptions _
	Implements IDisposable
  Visual C++
public ref class BaseImportOptions : IDisposable
 Inheritance Hierarchy
  System Object
  Autodesk.Revit.DB BaseImportOptions
  Autodesk.Revit.DB DGNImportOptions
  Autodesk.Revit.DB DWGImportOptions
  Autodesk.Revit.DB SATImportOptions
  Autodesk.Revit.DB SKPImportOptions
 See Also
  BaseImportOptions Members
  Autodesk.Revit.DB Namespace